Show / Hide Table of Contents
Class Segment3D
Represents a segment in three-dimensional space.
Inheritance
System.Object
OpenObject
OpenElementId
Segment3D
ArcSegment3D
LineSegment3D
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Geometry3D
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class Segment3D : OpenElementId
Properties
Improve this Doc   View Source
EndPoint
Gets or sets the reference to Point3D endpoint of the segment.
Declaration
public ReferenceElement EndPoint { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
LocalCoordinateSystem
Local coordinate system
Declaration
public CoordSystem LocalCoordinateSystem { get; set; }
Property Value
 Type |  Description
 CoordSystem
Improve this Doc   View Source
StartPoint
Gets or sets the reference to Point3D startpoint of the segment.
Declaration
public ReferenceElement StartPoint { get; set; }
Property Value
 Type |  Description
 ReferenceElement
 Improve this Doc
 View Source